Documents/МодернизацияНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>МодернизацияНМА</Name>
			<Comment>(Общ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПервоначальныеСведенияНМАНалоговыйУчет</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьНМА</xr:Item>
				<xr:Item>AccumulationRegister.СтроительствоОбъектовОсновныхСредств</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.ПервоначальныеСведенияНМАБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ПервоначальныеСведенияНМА</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬОтражатьВНалоговомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьНУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаБУВнеоборотногоАктива</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬСтатьяВаловыхРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сдал</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принял</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительОтдела</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаМодернизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияМодернизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧтоНеВыполнено</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧтоИзменилось</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьУУ</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НМА</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АмортизацияБУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизацияЗаМесяцБУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродукцииРаботБУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НематериальныйАктив</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользованияБУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьБУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМодернизацииБУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМодернизацииНУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛиквидационнаяСтоимостьБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизацияУУ</Name>
							<Comment>(Упр)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизацияЗаМесяцУУ</Name>
							<Comment>(Упр)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьУУ</Name>
							<Comment>(Упр)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМодернизацииУУ</Name>
							<Comment>(Упр)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛиквидационнаяСтоимостьУУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродукцииРаботУУ</Name>
							<Comment>(Упр)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользованияУУ</Name>
							<Comment>(Упр)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьНУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользованияНУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/МодернизацияНМА/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;

// Строки, хранят реквизиты имеющие смысл только для бух. учета
// в случае если документ не отражается в каком-то виде учета, делаются невидимыми

Перем мСтрокаРеквизитыБухУчета Экспорт; // (Регл)
Перем мСтрокаРеквизитыНалУчета Экспорт; // (Регл)

#Если Клиент Тогда

// Функция формирует табличный документ унифицированной формы ОЗ-2
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ по форме ОЗ-2.
//
Функция ПечатьОЗ2(ПечатьПоДаннымУпрУчета = Истина)

	Макет       = ПолучитьОбщийМакет("ОЗ2");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Форма_ОЗ2";
	
	
	Если Не ПечатьПоДаннымУпрУчета Тогда
		
		Запрос       = Новый Запрос;
		Запрос.УстановитьПараметр("Период"            , МоментВремени());
		Запрос.УстановитьПараметр("ТекОрганизация"    , Организация);
		Запрос.УстановитьПараметр("ГлавныйБухгалтер"  , Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
		Запрос.УстановитьПараметр("РуководительОтдела", РуководительОтдела);
		Запрос.УстановитьПараметр("Сдал"              , Сдал);
		Запрос.УстановитьПараметр("Принял"            , Принял);
		Запрос.УстановитьПараметр("Ссылка"            , Ссылка);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КодыОрганизации.Организация.НаименованиеПолное                КАК Организация,
		|	КодыОрганизации.КодПоЕДРПОУ                                   КАК ЕДРПОУ,
		|	МодернизацияОС.Номер                                          КАК НомерАкта,
		|	МодернизацияОС.Дата                                           КАК ДатаАкта,
		|	МодернизацияОС.СобытиеОС                                      КАК ВидОперации,
		|	МодернизацияОС.СчетУчетаБУВнеоборотногоАктива                 КАК СчетКт,
		|	МодернизацияОС.ДатаНачалаМодернизации                         КАК ДатаНачала,
		|	МодернизацияОС.ДатаОкончанияМодернизации                      КАК ДатаОкончания,
		|	МодернизацияОС.ЧтоНеВыполнено                                 КАК ЧтоНеВыполнено,
		|	МодернизацияОС.ЧтоИзменилось                                  КАК ЧтоИзменилось,
		|	РАЗНОСТЬДАТ(МодернизацияОС.ДатаНачалаМодернизации,
		|	            МодернизацияОС.ДатаОкончанияМодернизации,
		|	            ДЕНЬ)                                             КАК КоличествоДней,
		|	ФИОГлавногоБухгалтера.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИОГлавногоБухгалтера.Имя, 1, 1) + "". "" 
		|		+ ПОДСТРОКА(ФИОГлавногоБухгалтера.Отчество, 1, 1) + ""."" КАК ГлавныйБухгалтер,
		|	ФИОРуководителяОтдела.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИОРуководителяОтдела.Имя, 1, 1) + "". "" 
		|		+ ПОДСТРОКА(ФИОРуководителяОтдела.Отчество, 1, 1) + ""."" КАК РуководительОтдела,
		|	ФИОСдал.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИОСдал.Имя, 1, 1) + "". ""
		|		+ ПОДСТРОКА(ФИОСдал.Отчество, 1, 1) + "".""               КАК Сдал,
		|	ФИОПринял.Фамилия + "" ""
		|		+ ПОДСТРОКА(ФИОПринял.Имя, 1, 1) + "". ""
		|		+ ПОДСТРОКА(ФИОПринял.Отчество, 1, 1) + "".""             КАК Принял,
		|	ДолжностьСдал.Должность                                       КАК СдалДолжность,
		|	ДолжностьПринял.Должность                                     КАК ПринялДолжность
		|ИЗ
		|	Документ.МодернизацияОС КАК МодернизацияОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.КодыОрганизации.СрезПоследних(
		|			                &Период,
		|			                Организация = &ТекОрганизация) КАК КодыОрганизации
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|		                    &Период,
		|		                    Организация = &ТекОрганизация
		|		                    И Сотрудник.Физлицо = &Сдал) КАК ДолжностьСдал
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|		                    &Период,
		|		                    Организация = &ТекОрганизация
		|		                    И Сотрудник.Физлицо = &Принял) КАК ДолжностьПринял
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|		                    &Период,
		|		                    ФизЛицо В
		|		                    (ВЫБРАТЬ
		|		                        ОтветственныеЛица.ФизическоеЛицо
		|		                    ИЗ
		|		                        РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		|		                                        &Период,
		|		                                        СтруктурнаяЕдиница = &ТекОрганизация
		|		                            И ОтветственноеЛицо = &ГлавныйБухгалтер) КАК ОтветственныеЛица)
		|			                 ) КАК ФИОГлавногоБухгалтера
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|			                &Период, 
		|			                ФизЛицо = &РуководительОтдела) КАК ФИОРуководителяОтдела
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|			                &Период,
		|			                ФизЛицо = &Сдал) КАК ФИОСдал
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|			                &Период,
		|			                ФизЛицо = &Принял) КАК ФИОПринял
		|		ПО (ИСТИНА)
		|ГДЕ
		|	МодернизацияОС.Ссылка = &Ссылка";
		ВыборкаПоШапке = Запрос.Выполнить().Выбрать();
		ВыборкаПоШапке.Следующий();
	
	КонецЕсли;

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",         Ссылка);
	Запрос.УстановитьПараметр("Период",         МоментВремени());
	Запрос.УстановитьПараметр("ТекОрганизация", Организация);
	
	СписокОС = НМА.ВыгрузитьКолонку("ОсновноеСредство");
	Запрос.УстановитьПараметр("СписокОС",       СписокОС);
	
	Если ПечатьПоДаннымУпрУчета Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МодернизацияОСОС.Ссылка.Номер                        КАК НомерАкта,
		|	МодернизацияОСОС.Ссылка.Дата                         КАК ДатаАкта,
		|	МодернизацияОСОС.Ссылка.СобытиеОС                    КАК ВидОперации,
		|	МодернизацияОСОС.ОсновноеСредство.Код                КАК ИнвентарныйНомер,
		|	МодернизацияОСОС.ОсновноеСредство.ЗаводскойНомер     КАК ЗаводскойНомер,
		|	МодернизацияОСОС.ОсновноеСредство.НаименованиеПолное КАК ОсновноеСредствоНаименование,
		|	МодернизацияОСОС.СуммаМодернизацииУУ                 КАК СуммаМодернизации,
		|	МодернизацияОСОС.ЛиквидационнаяСтоимостьУУ           КАК ЛиквидационнаяСтоимость,
		|	МодернизацияОСОС.СрокПолезногоИспользованияУУ        КАК СрокПолезногоИспользования,
		|	МодернизацияОСОС.ОбъемПродукцииРаботУУ               КАК ОбъемПродукцииРабот,
		|	МодернизацияОСОС.Ссылка.Сдал       					 КАК Сдал,
		|	МодернизацияОСОС.Ссылка.Принял       				 КАК Принял,
		|	МодернизацияОСОС.Ссылка.ДатаНачалаМодернизации       КАК ДатаНачала,
		|	МодернизацияОСОС.Ссылка.ДатаОкончанияМодернизации    КАК ДатаОкончания,
		|	МодернизацияОСОС.Ссылка.ЧтоНеВыполнено 				 КАК ЧтоНеВыполнено,
		|	МодернизацияОСОС.Ссылка.ЧтоИзменилось                КАК ЧтоИзменилось,
		|	РАЗНОСТЬДАТ(МодернизацияОСОС.Ссылка.ДатаНачалаМодернизации,
		|	            МодернизацияОСОС.Ссылка.ДатаОкончанияМодернизации,
		|	            ДЕНЬ)                                    КАК КоличествоДней,
		|	МестонахождениеОС.МОЛ.Код                            КАК КодМОЛа,
		|	МестонахождениеОС.Местонахождение.Наименование       КАК Подразделение
		|ИЗ
		|	Документ.МодернизацияОС.ОС КАК МодернизацияОСОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.МестонахождениеОС.СрезПоследних КАК МестонахождениеОС
		|		ПО МодернизацияОСОС.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
		|ГДЕ
		|	МодернизацияОСОС.Ссылка = &Ссылка";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МодернизацияОСОС.ОсновноеСредство.ЗаводскойНомер       КАК ЗаводскойНомер,
		|	МодернизацияОСОС.ОсновноеСредство.НаименованиеПолное   КАК ОсновноеСредствоНаименование,
		|	МодернизацияОСОС.СуммаМодернизацииБУ                   КАК СуммаМодернизации,
		|	СчетаБухгалтерскогоУчетаОС.СчетУчета                   КАК СчетДт,
		|	ПервоначальныеСведенияОС.ИнвентарныйНомер              КАК ИнвентарныйНомер,
		|	МестонахождениеОС.МОЛ.Код                              КАК КодМОЛа,
		|	МестонахождениеОС.Местонахождение.Наименование         КАК Подразделение
		|ИЗ
		|	Документ.МодернизацияОС.ОС КАК МодернизацияОСОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
		|		                    &Период,
		|		                    Организация = &ТекОрганизация
		|		                    И ОсновноеСредство В (&СписокОС)) КАК СчетаБухгалтерскогоУчетаОС
		|		ПО МодернизацияОСОС.ОсновноеСредство = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
		|		                    &Период,
		|		                    Организация = &ТекОрганизация
		|		                    И ОсновноеСредство В (&СписокОС)) КАК ПервоначальныеСведенияОС
		|		ПО МодернизацияОСОС.ОсновноеСредство = ПервоначальныеСведенияОС.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
		|		                    &Период,
		|		                    Организация = &ТекОрганизация
		|		                    И ОсновноеСредство В (&СписокОС)) КАК МестонахождениеОС
		|		ПО МодернизацияОСОС.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
		|ГДЕ
		|	МодернизацияОСОС.Ссылка = &Ссылка";
	
	КонецЕсли;	
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	НеПервая = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если НеПервая Тогда
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОЗ2");
		
		Если Не ПечатьПоДаннымУпрУчета Тогда
			
			ОбластьМакета.Параметры.Заполнить(ВыборкаПоШапке);
			//ОбластьМакета.Параметры.Организация = СокрП(ВыборкаПоШапке.Организация);
			
		Иначе
			
			ОбластьМакета.Параметры.Организация = "Управлінський облік";
			
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(Выборка);
			
		ТабДокумент.Вывести(ОбластьМакета);
		НеПервая = Истина;
	
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции // ПечатьОЗ2()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "ОЗ2упр" тогда
		
		// Управленческая печатная форма документа
		ТабДокумент = ПечатьОЗ2();
		
	ИначеЕсли ИмяМакета = "ОЗ2бух" тогда
		
		// Бухг печатная форма документа
		ТабДокумент = ПечатьОЗ2(Ложь);
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, НСтр("ru='Модернизация ОС';uk='Модернізація ОЗ'")), Ссылка);

КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для определенного вида учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета() Экспорт

	ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл();

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчета()

// Процедура заполняет структуры именами реквизитов, которые имеют смысл
// только для регламентированного учета
//
Процедура ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл()

	мСтрокаРеквизитыБухУчета =  "СтоимостьБУ,
								|СчетУчетаБУВнеоборотногоАктива,
								|НМА.СрокПолезногоИспользованияБУ,
								|НМА.ОбъемПродукцииРаботБУ,
								|НМА.СтоимостьБУ,
								|НМА.СуммаМодернизацииБУ,
								|НМА.АмортизацияБУ,
								|НМА.АмортизацияЗаМесяцБУ,
								|НМА.ОстСтоимостьБУ,
								|НМА.ЛиквидационнаяСтоимостьБУ";

	мСтрокаРеквизитыНалУчета =  "СтоимостьНУ,
								|НМА.СуммаМодернизацииНУ";

КонецПроцедуры // ЗаполнитьСписокРеквизитовЗависимыхОтТиповУчетаРегл()

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , Ложь);
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыльДо2015" , Ложь);
	СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , Ложь);
	
	Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.Организация) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Отказ, Организация, "Нал");
	
	Если НЕ Отказ Тогда
		
		СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , мУчетнаяПолитикаНУ.ЕстьНалогНаПрибыль);
		СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыльДо2015", мУчетнаяПолитикаНУ.ЕстьНалогНаПрибыльДо2015);
		СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , мУчетнаяПолитикаНУ.ЕстьНДС);
		
	КонецЕсли;
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(РежимПроведения,СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	ОбязательныеРеквизитыШапки = "Организация, ОбъектСтроительства, СчетУчетаБУВнеоборотногоАктива";
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете 
		 И СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		 
		 Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.НалоговоеНазначениеОбъектаСтроительства) Тогда
			 
			 ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не заполнено налоговое назначение у объекта строительства';uk=""Не заповнене податкове призначення в об'єкта будівництва"""), Отказ, Заголовок);
		 	
		 КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверка реквизитов в ТЧ по упр. учету
// 
Процедура ПроверкаРеквизитовТЧУпр(ТаблицаНМА,СтруктураШапкиДокумента,Отказ, Заголовок)
	
	Если Не ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;	
	
	// Проверим что суммы модернизации относимые на каждый объект НМА в сумме равный данным из шапки документа
	Если ТаблицаНМА.Итог("СуммаМодернизацииУУ")<> СтруктураШапкиДокумента.СтоимостьУУ Тогда
		
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='По управленческому учету общая сумма модернизации, указанная в шапке документа, не соответствует в итоге суммам, отнесенным на нематериальные активы!';uk='По управлінському обліку загальна сума модернізації, зазначена в шапці документа, не відповідає в результаті сумам, віднесеним на нематеріальні активи!'"), Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеТЧУпр

// Проверка реквизитов в ТЧ по регл. учету
// 
Процедура ПроверкаРеквизитовТЧРегл(ТаблицаНМА,СтруктураШапкиДокумента,Отказ, Заголовок)

	Если Не ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;	
	
	// Проверим что суммы модернизации относимые на каждый объект НМА в сумме равны данным из шапки документа
	Если ТаблицаНМА.Итог("СуммаМодернизацииБУ")<> СтруктураШапкиДокумента.СтоимостьБУ Тогда
		
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='По бухгалтерскому учету общая сумма модернизации, не соответствует в итоге суммам, отнесенным на нематериальные активы!';uk='По бухгалтерському обліку загальна сума модернізації, не відповідає в підсумку сумам, віднесеним на нематериальні активи!'"), Отказ, Заголовок);
							 
	КонецЕсли;

	Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
		 
		// Проверим что суммы модернизации относимые на каждый объект НМА в сумме равны данным из шапки документа
		Если СтруктураШапкиДокумента.Дата < глЗначениеПеременной("ДатаНКУ2015") И ТаблицаНМА.Итог("СуммаМодернизацииНУ")<> СтруктураШапкиДокумента.СтоимостьНУ Тогда
			
			ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='По налоговому учету общая сумма модернизации, не соответствует в итоге суммам, отнесенным на нематериальные активы!';uk='По податковому обліку загальна сума модернізації, не відповідає в підсумку сумам, віднесеним на нематериальні активи!'"), Отказ, Заголовок);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет правильность заполнения реквизитов документа
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаНМА,СтруктураШапкиДокумента,Отказ, Заголовок) Экспорт

	РеквизитыТабНМА = "НематериальныйАктив"; //через запятую
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "НМА", Новый Структура(РеквизитыТабНМА), Отказ, Заголовок);

	// Логические проверки
	ПроверкаРеквизитовТЧУпр(ТаблицаНМА,СтруктураШапкиДокумента,Отказ, Заголовок);
	ПроверкаРеквизитовТЧРегл(ТаблицаНМА,СтруктураШапкиДокумента,Отказ, Заголовок);

КонецПроцедуры // ПроверкаРеквизитов()

Процедура ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоНМА, ТаблицаПервоначальныхДанных, Отказ, Заголовок)

	Если НЕ СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;

	ДатаДока = Дата;

	АмортизацияНМА          	= Движения.СтоимостьНМА;
	ПервоначальныеСведенияНМА	= Движения.ПервоначальныеСведенияНМА;
	НазваниеДокумента      		= Метаданные().Представление();

	ТаблицаДвиженийАмортизация = АмортизацияНМА.Выгрузить();
	
	Для каждого СтрокаТЧ Из ТаблицаПоНМА Цикл

		ТекНМА = СтрокаТЧ.НематериальныйАктив;

		ТекПервоначальныеДанные 	= ТаблицаПервоначальныхДанных.Найти(СтрокаТЧ.НематериальныйАктив,"НМА_УУ");
		
		// Движения по регистру ПервоначальныеСведенияНМА
		Движение = ПервоначальныеСведенияНМА.Добавить();
		Движение.Период 										= ДатаДока;
		Движение.НематериальныйАктив        					= ТекНМА;
		Движение.СрокПолезногоИспользования                 	= СтрокаТЧ.СрокПолезногоИспользованияУУ;
		
		Движение.ПервоначальнаяСтоимость          				= Макс(0, СтрокаТЧ.СтоимостьУУ + СтрокаТЧ.СуммаМодернизацииУУ); 
		Движение.ОбъемПродукцииРаботДляВычисленияАмортизации 	= Макс(0, СтрокаТЧ.ОбъемПродукцииРаботУУ);
		Движение.ЛиквидационнаяСтоимость                     	= СтрокаТЧ.ЛиквидационнаяСтоимостьУУ;
		Движение.НачислятьАмортизацию 			= ТекПервоначальныеДанные.НачислятьАмортизацию_УУ;
		Движение.СпособНачисленияАмортизации 	= ТекПервоначальныеДанные.СпособНачисленияАмортизации_УУ;
		
		// Движения по регистру СтоимостьНМА
		Движение = ТаблицаДвиженийАмортизация.Добавить();
		Движение.НематериальныйАктив 	= ТекНМА;
		Движение.Амортизация 			= 0;
		Движение.Стоимость				= СтрокаТЧ.СуммаМодернизацииУУ;


	КонецЦикла;

	АмортизацияНМА.мПериод          = ДатаДока;
	АмортизацияНМА.мТаблицаДвижений = ТаблицаДвиженийАмортизация;
	Движения.СтоимостьНМА.ВыполнитьПриход();
	
	// Движения по регистру Строительство
	СтроительствоОС       = Движения.СтроительствоОбъектовОсновныхСредств;
	ТаблицаСтроительство = СтроительствоОС.Выгрузить();
	Движение = ТаблицаСтроительство.Добавить();
	Движение.ОбъектСтроительства        = СтруктураШапкиДокумента.ОбъектСтроительства;
	Движение.Сумма                      = ТаблицаПоНМА.Итог("СуммаМодернизацииУУ");
	
	СтроительствоОС.мПериод          = ДатаДока;
	СтроительствоОС.мТаблицаДвижений = ТаблицаСтроительство;
	Движения.СтроительствоОбъектовОсновныхСредств.ВыполнитьРасход();


КонецПроцедуры

Процедура ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, ТаблицаПоНМА, ТаблицаПервоначальныхДанных, Отказ, Заголовок)


	Если (НЕ СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете) Тогда
		Возврат;
	КонецЕсли;

	ДатаДока       = Дата;
	ТекОрганизация = СтруктураШапкиДокумента.Организация;

	УправлениеВнеоборотнымиАктивами.ДополнитьТабличнуюЧастьСведениямиОбНМАБухНалогРегл(МоментВремени(), ТаблицаПоНМА,
	                                                  СтруктураШапкиДокумента, Отказ, Заголовок);

	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли;								
													  
	ПервоначальныеСведенияНМА = Движения.ПервоначальныеСведенияНМАБухгалтерскийУчет;
	ПервоначальныеСведенияНМА_НУ 	= Движения.ПервоначальныеСведенияНМАНалоговыйУчет;
	ПроводкиБУ             = Движения.Хозрасчетный;
	ТабАмортизации         = Неопределено;
	
	НеОблНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
	
	Для каждого СтрокаТЧ Из ТаблицаПоНМА Цикл

		ТекНМА = СтрокаТЧ.НематериальныйАктив;

		ТекПервоначальныеДанные 	= ТаблицаПервоначальныхДанных.Найти(СтрокаТЧ.НематериальныйАктив,"НМА_БУ");
		
		НепроизводственноеНМА = (СтрокаТЧ.НалоговоеНазначение_НМА = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
		
		// Движения по регистру ПервоначальныеСведенияНМАБухгалтерскийУчет
		Движение = ПервоначальныеСведенияНМА.Добавить();
		Движение.Период 										= ДатаДока;
		Движение.НематериальныйАктив 							= ТекНМА;
		Движение.Организация 									= ТекОрганизация;
		Движение.СрокПолезногоИспользования                 	= СтрокаТЧ.СрокПолезногоИспользованияБУ;
		Движение.ПервоначальнаяСтоимость            			= Макс(0, СтрокаТЧ.СтоимостьБУ 
		                                                              		+ СтрокаТЧ.СуммаМодернизацииБУ);
		Движение.ОбъемПродукцииРаботДляВычисленияАмортизации  	= Макс(0, СтрокаТЧ.ОбъемПродукцииРаботБУ);
		Движение.ЛиквидационнаяСтоимость                      	= СтрокаТЧ.ЛиквидационнаяСтоимостьБУ;
		Движение.НачислятьАмортизацию 							= ТекПервоначальныеДанные.НачислятьАмортизацию_БУ;
		Движение.СпособНачисленияАмортизации 					= ТекПервоначальныеДанные.СпособНачисленияАмортизации_БУ;

		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда 
			
			ТекПервоначальныеДанные 	= ТаблицаПервоначальныхДанных.Найти(СтрокаТЧ.НематериальныйАктив,"НМА_НУ");
			
			// Движения по регистру ПервоначальныеСведенияНМАНалоговыйУчет
			Движение = ПервоначальныеСведенияНМА_НУ.Добавить();
			Движение.Период           			= ДатаДока;
			Движение.НематериальныйАктив 		= ТекНМА;
			Движение.Организация      			= ТекОрганизация;
			Движение.ПервоначальнаяСтоимостьНУ 	= ТекПервоначальныеДанные.ПервоначальнаяСтоимость_НУ + СтрокаТЧ.СуммаМодернизацииНУ; 
			Движение.ПервоначальнаяСтоимостьНУ 	= Макс(0, СтрокаТЧ.СтоимостьНУ + СтрокаТЧ.СуммаМодернизацииНУ);
			Движение.СрокПолезногоИспользования = СтрокаТЧ.СрокПолезногоИспользованияНУ;
			Движение.НачислятьАмортизацию 		= ТекПервоначальныеДанные.НачислятьАмортизацию_НУ;
			Движение.НалоговоеНазначение 		= ТекПервоначальныеДанные.НалоговоеНазначение_НУ;
			Движение.НалоговаяГруппаОС 			= СтрокаТЧ.НалоговаяГруппаОС;
			Движение.СпособНачисленияАмортизации = ТекПервоначальныеДанные.СпособНачисленияАмортизации_НУ;
			
		КонецЕсли;	
		
		// списание модернизации Д СчетУчета К СчетУчетаВнеоборотногоАктива
		СуммаПроводки 	= СтрокаТЧ.СуммаМодернизацииБУ;
		СуммаПроводкиНУ = СтрокаТЧ.СуммаМодернизацииНУ;
		
		Если СуммаПроводки <> 0 Тогда

			Проводка = ПроводкиБУ.Добавить();

			Проводка.Период       = ДатаДока;
			Проводка.Организация  = ТекОрганизация;
			Проводка.Содержание   = "Модернизация """ + ТекНМА + """";
			Проводка.НомерЖурнала = "НМА";
			Проводка.Сумма        = СуммаПроводки;
			
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль ИЛИ СтруктураШапкиДокумента.ЕстьНДС Тогда
				Проводка.НалоговоеНазначениеДт  = СтрокаТЧ.НалоговоеНазначение_НМА;
			КонецЕсли;
				
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			    Проводка.СуммаНУДт 				= СуммаПроводкиНУ;
			КонецЕсли;
			
			Проводка.СчетДт       = СтрокаТЧ.СчетУчетаБУ;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НематериальныеАктивы", ТекНМА);
			
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль ИЛИ СтруктураШапкиДокумента.ЕстьНДС Тогда
				Проводка.НалоговоеНазначениеКт  = СтруктураШапкиДокумента.ОбъектСтроительства.НалоговоеНазначение;
			КонецЕсли;
			
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 Тогда
			    Проводка.СуммаНУКт 				= СуммаПроводкиНУ;
			КонецЕсли;
			
			Проводка.СчетКт       = СтруктураШапкиДокумента.СчетУчетаБУВнеоборотногоАктива;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ОбъектыСтроительства", СтруктураШапкиДокумента.ОбъектСтроительства);
			
			Если НЕ СтруктураШапкиДокумента.ЕстьНДС Тогда
				// организация - не плательщик НДС. 
				Если НепроизводственноеНМА Тогда
					// Непроизводственное
					Проводка.НалоговоеНазначениеДт = СтрокаТЧ.НалоговоеНазначение_НМА;
				Иначе	
					Проводка.НалоговоеНазначениеДт = НеОблНДСДеятельность;
				КонецЕсли;	
				
				Проводка.НалоговоеНазначениеКт = НеОблНДСДеятельность;
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет движения по регистрам 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаПоНМА, ТаблицаПервоначальныхДанных, Отказ, Заголовок)

	ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоНМА, ТаблицаПервоначальныхДанных, Отказ, Заголовок);
	ДвиженияПоРегистрамРегл(СтруктураШапкиДокумента, ТаблицаПоНМА, ТаблицаПервоначальныхДанных, Отказ, Заголовок);
	

КонецПроцедуры

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ,РежимПроведения)
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	СтруктураШапкиДокумента.Вставить("НалоговоеНазначениеОбъектаСтроительства", 
	                                 СтруктураШапкиДокумента.ОбъектСтроительства.НалоговоеНазначение);
                                                                                                    
	// Получим данные учетной политики                                                             
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(РежимПроведения,СтруктураШапкиДокумента, Отказ, Заголовок);

	СтруктураПолей = Новый Структура;

	СтруктураПолей.Вставить("НематериальныйАктив",             "НематериальныйАктив");

	СтруктураПолей.Вставить("СтоимостьУУ",                  "СтоимостьУУ");
	СтруктураПолей.Вставить("СуммаМодернизацииУУ",          "СуммаМодернизацииУУ");
	СтруктураПолей.Вставить("АмортизацияУУ",                "АмортизацияУУ");
	СтруктураПолей.Вставить("АмортизацияЗаМесяцУУ",         "АмортизацияЗаМесяцУУ");
	СтруктураПолей.Вставить("ЛиквидационнаяСтоимостьУУ",    "ЛиквидационнаяСтоимостьУУ");
	
	СтруктураПолей.Вставить("СрокПолезногоИспользованияУУ", "СрокПолезногоИспользованияУУ");
	
	СтруктураПолей.Вставить("ОбъемПродукцииРаботУУ",        "ОбъемПродукцииРаботУУ");
	
	СтруктураПолей.Вставить("СтоимостьБУ",                  "СтоимостьБУ");
	СтруктураПолей.Вставить("СуммаМодернизацииБУ",          "СуммаМодернизацииБУ");
	СтруктураПолей.Вставить("АмортизацияБУ",                "АмортизацияБУ");
	СтруктураПолей.Вставить("АмортизацияЗаМесяцБУ",         "АмортизацияЗаМесяцБУ");
	СтруктураПолей.Вставить("ЛиквидационнаяСтоимостьБУ",    "ЛиквидационнаяСтоимостьБУ");
	
	СтруктураПолей.Вставить("СрокПолезногоИспользованияБУ", "СрокПолезногоИспользованияБУ");
	
	СтруктураПолей.Вставить("ОбъемПродукцииРаботБУ",        "ОбъемПродукцииРаботБУ");

	СтруктураПолей.Вставить("СтоимостьНУ",                  "СтоимостьНУ");
	СтруктураПолей.Вставить("СрокПолезногоИспользованияНУ", "СрокПолезногоИспользованияНУ");
	СтруктураПолей.Вставить("СуммаМодернизацииНУ",          "СуммаМодернизацииНУ");

	РезультатЗапросаПоНМА = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "НМА", СтруктураПолей);
	ТаблицаПоНМА          = РезультатЗапросаПоНМА.Выгрузить();
	
	ПроверкаРеквизитовТЧ(ТаблицаПоНМА, СтруктураШапкиДокумента,Отказ, Заголовок);
	
	//проверка, нет ли списанных НМА в табличной части
	УправлениеВнеоборотнымиАктивами.ПроверитьНаСписанностьНМА(Дата, Организация, ТаблицаПоНМА, ОтражатьВУправленческомУчете, ОтражатьВБухгалтерскомУчете, Отказ, Заголовок);
	
    УправлениеВнеоборотнымиАктивами.ПроверитьДублированиеОСиНМАвТабличнойЧасти(НМА, "НематериальныйАктив", НСтр("ru='Нематериальный актив';uk='Нематеріальний актив'"), Отказ, Заголовок);

	// подготовка первоначальной таблицы
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТекОрганизация",  СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("ТекПериод",       Дата);
	Запрос.УстановитьПараметр("ВнешнийИсточник", ТаблицаПоНМА);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
   	|	НематериальныйАктив
	|ПОМЕСТИТЬ НематериальныеАктивы
	|ИЗ &ВнешнийИсточник КАК ВнешнийИсточник
	|";
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НематериальныеАктивы.НематериальныйАктив 					КАК НематериальныйАктив,
	|	ПервоначальныеСведенияНМА_УУ.НематериальныйАктив 			КАК НМА_УУ,
	|	ПервоначальныеСведенияНМА_УУ.НачислятьАмортизацию 			КАК НачислятьАмортизацию_УУ,
	|	ПервоначальныеСведенияНМА_УУ.СпособНачисленияАмортизации 	КАК СпособНачисленияАмортизации_УУ,
	|	ПервоначальныеСведенияНМА_БУ.НематериальныйАктив 			КАК НМА_БУ,
	|	ПервоначальныеСведенияНМА_БУ.НачислятьАмортизацию 			КАК НачислятьАмортизацию_БУ,
	|	ПервоначальныеСведенияНМА_БУ.СпособНачисленияАмортизации 	КАК СпособНачисленияАмортизации_БУ,
	|	ПервоначальныеСведенияНМА_НУ.НематериальныйАктив 			КАК НМА_НУ,
	|	ПервоначальныеСведенияНМА_НУ.НачислятьАмортизацию 			КАК НачислятьАмортизацию_НУ,
	|	ПервоначальныеСведенияНМА_НУ.СпособНачисленияАмортизации 	КАК СпособНачисленияАмортизации_НУ,
	|	ПервоначальныеСведенияНМА_НУ.СрокПолезногоИспользования 	КАК СрокПолезногоИспользования_НУ,
	|	ПервоначальныеСведенияНМА_НУ.НалоговаяГруппаОС 				КАК НалоговаяГруппаОС,
	|	ПервоначальныеСведенияНМА_НУ.ПервоначальнаяСтоимостьНУ	 	КАК ПервоначальнаяСтоимость_НУ,
	|	ПервоначальныеСведенияНМА_НУ.НалоговоеНазначение 			КАК НалоговоеНазначение_НУ
	|ИЗ
	|	НематериальныеАктивы
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПоследних(&ТекПериод, НематериальныйАктив В (ВЫБРАТЬ НематериальныйАктив ИЗ НематериальныеАктивы) И Организация = &ТекОрганизация) КАК ПервоначальныеСведенияНМА_БУ
	|	ПО НематериальныеАктивы.НематериальныйАктив = ПервоначальныеСведенияНМА_БУ.НематериальныйАктив
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчет.СрезПоследних(&ТекПериод, НематериальныйАктив В (ВЫБРАТЬ НематериальныйАктив ИЗ НематериальныеАктивы) И Организация = &ТекОрганизация) КАК ПервоначальныеСведенияНМА_НУ
	|	ПО НематериальныеАктивы.НематериальныйАктив = ПервоначальныеСведенияНМА_НУ.НематериальныйАктив
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияНМА.СрезПоследних(&ТекПериод, НематериальныйАктив В (ВЫБРАТЬ НематериальныйАктив ИЗ НематериальныеАктивы)) КАК ПервоначальныеСведенияНМА_УУ
	|	ПО НематериальныеАктивы.НематериальныйАктив = ПервоначальныеСведенияНМА_УУ.НематериальныйАктив
	|";
	ТаблицаПервоначальныхДанных = Запрос.Выполнить().Выгрузить();
	
	Если Не Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаПоНМА, ТаблицаПервоначальныхДанных, Отказ, Заголовок);
		
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры // ОбработкаПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтражатьВБухгалтерскомУчете Тогда
		ДатаНКУ2015 = глЗначениеПеременной("ДатаНКУ2015");
		Если Дата >= ДатаНКУ2015 Тогда
			СтоимостьНУ = СтоимостьБУ;
			Для Каждого СтрокаНМА Из НМА Цикл
				СтрокаНМА.СуммаМодернизацииНУ = СтрокаНМА.СуммаМодернизацииБУ;
			КонецЦикла; 
		КонецЕсли;	
		
		мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Отказ, Организация, "Нал");
		
		Если НЕ Отказ Тогда
			Если НЕ мУчетнаяПолитикаНУ.ЕстьНалогНаПрибыль Тогда
				СтоимостьНУ = 0;	
				Для Каждого СтрокаНМА Из НМА Цикл
					СтрокаНМА.СуммаМодернизацииНУ = 0;
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли;	
	КонецЕсли;	
	
	
	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры
